---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarInSystem.GetDistributionPath
source: html/c659fd9d-0cbc-0340-b364-02b0a082d2de.htm
---
# Autodesk.Revit.DB.Structure.RebarInSystem.GetDistributionPath Method

The distribution path of a rebar set.

## Syntax (C#)
```csharp
public Line GetDistributionPath()
```

## Returns
A line beginning at (0, 0, 0) and representing the direction and
 length of the set.